CREATE TABLE type (
	id SERIAL PRIMARY KEY,
	name TEXT
);

CREATE TABLE product (
	id SERIAL PRIMARY KEY,
	name TEXT,
	expired_date DATE,
	price FLOAT,
	type_id INT REFERENCES type(id)
);

INSERT INTO type (name) VALUES 
('СЫР'),
('МОЛОКО'),
('КОЛБАСА');

INSERT INTO product (name, expired_date, price, type_id) VALUES 
('Сыр "Гауда"', '2024-04-01', 5.99, 1), ('Сыр "Чеддер"', '2024-03-15', 6.99, 1), ('Сыр "Рокфор"', '2024-03-20', 7.99, 1),
('Сыр "Бри"', '2024-04-10', 8.99, 1), ('Сыр "Моцарелла"', '2024-04-05', 9.99, 1), ('Сыр "Пармезан"', '2024-03-01', 10.99, 1),
('Сыр "Фета"', '2024-03-10', 11.99, 1), ('Сыр "Груер"', '2024-02-25', 12.99, 1), ('Сыр "Эдам"', '2024-03-30', 13.99, 1),
('Сыр "Манчего"', '2024-04-15', 14.99, 1),
('Молоко пастеризованное', '2024-03-20', 2.99, 2), ('Молоко цельное', '2024-03-25', 3.99, 2), ('Молоко обезжиренное', '2024-04-01', 4.99, 2),
('Молоко соевое', '2024-04-10', 5.99, 2), ('Молоко козье', '2024-04-05', 6.99, 2), ('Молоко миндальное', '2024-03-01', 7.99, 2),
('Молоко кокосовое', '2024-03-10', 8.99, 2), ('Молоко рисовое', '2024-02-25', 9.99, 2), ('Молоко овсяное', '2024-03-30', 10.99, 2),
('Молоко мороженое', '2024-04-15', 11.99, 2),
('Колбаса вареная', '2024-03-25', 6.49, 3), ('Колбаса сырокопченая', '2024-04-01', 7.49, 3), ('Колбаса салями', '2024-04-10', 8.49, 3),
('Колбаса охотничья', '2024-04-05', 9.49, 3), ('Колбаса ветчина', '2024-03-01', 10.49, 3), ('Колбаса копченая', '2024-03-10', 11.49, 3),
('Колбаса московская', '2024-02-25', 12.49, 3), ('Колбаса краковская', '2024-03-30', 13.49, 3), ('Колбаса докторская', '2024-04-15', 14.99, 3);